---
kind: property
id: P:Autodesk.Revit.DB.ParameterSet.IsEmpty
source: html/1c91de03-eb78-dd06-1a0c-bc2bc6719249.htm
---
# Autodesk.Revit.DB.ParameterSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.